---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotRedoFaceBased
source: html/de077b0f-d0b6-2b2b-9c77-15d81f28f928.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotRedoFaceBased Property

Faces defining this Element cannot be reacquired.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRedoFaceBased { get; }
```